Repository: Fabiarm/spsmribbon
Catalog: Code/1.0.0/dev/Resources/SPS.MRibbon.*.resx
Languages: ru_ru

# FA_Web_Description
source: Allow to manage ribbon for different sharepoint groups or users
ru_ru: Позволяет скрывать элементы ленты для разных SharePoint групп пользователей

# FA_Web_Title
source: Ribbon management
ru_ru: Управление лентой (Ribbon)

# PA_Alt
source: Allow to manage ribbon for sharepoint groups
ru_ru: Позволяет управлять лентой для разных SharePoint групп

# PA_Text
source: Ribbon
ru_ru: Лента

# SS_Msg_AccessDenied
source: You have no access to this page. Please contact with your administrator.
ru_ru: У вас нет прав для просмотра данной страницы. Пожалуйста обратитесь к администратору.

# SS_Msg_AccessDenied_Title
source: Information:
ru_ru: Информация:

# SS_Msg_Close_Title
source: Do you have unsaved changes. Do you want to save the settings?
ru_ru: У вас есть несохраненные изменения. Хотите сохранить изменения?

# SS_Msg_Remove_Title
source: Do you want to remove the group from list?
ru_ru: Вы хотите удалить группу из списка?

# SS_Msg_SaveTempory
source: Settings have been saved for selected group temporary
ru_ru: Настройки сохранены для данной группы локально

# SS_PreSave_Help
source: <span style="width: 20px; height: 20px; overflow: hidden; display: inline-block; position: relative;"> <img alt="" style="position: absolute; left: -195px; top: -174px;" src="/_layouts/15/images/spcommon.png" /> </span> Please save settings for the group. Any else the changes have been absent. If you want to save all changes please use button below on page.
ru_ru: <span style="width: 20px; height: 20px; overflow: hidden; display: inline-block; position: relative;"> <img alt="" style="position: absolute; left: -195px; top: -174px;" src="/_layouts/15/images/spcommon.png" /> </span> Пожалуйста сохраните изменения для выбранной группы. Иначе ваши изменения будут потеряны. Если вы хотите сохранить все изменения то воспользуйтесь кнопкой ниже.

# SS_Tabs_Title
source: Please select category of ribbon to hide for selected sharepoint group:
ru_ru: Выберите категорию ленты, которую хотите скрыть для выбранной группы:

# SS_TD_Picker_Title
source: Please select category of ribbon to HIDE for selected group:
ru_ru: Выберите категорию ленты, которую хотите скрыть для группы:

# SS_TH_Groups
source: Selected groups
ru_ru: Выбранные группы

# SS_TH_Picker
source: Use picker to find sharepoint group
ru_ru: Используйте пикер для поиска групп

# SS_Help
source: <p style="padding-right: 5px; font-size: 15px;margin:0px;"> Please find sharepoint group using picker group. When you found group you can add the group to list please use button <span style="width: 22px; height: 22px; overflow: hidden; display: inline-block; position: relative;"> <img alt="" style="position: absolute; left: -65px; top: -179px; cursor: pointer;" src="/_layouts/15/images/spcommon.png" /> </span> <br /> To select group use button <span style="cursor: pointer; width: 20px; height: 20px; overflow: hidden; display: inline-block; position: relative; vertical-align: top;"> <img style="position: absolute; left: -178px; top: -31px;" src="/_layouts/15/images/spcommon.png" /> </span> <br /> To remove group use button <span style="cursor: pointer; width: 20px; height: 20px; overflow: hidden; display: inline-block; position: relative; vertical-align: top;"> <img style="position: absolute; left: -178px; top: -75px;" src="/_layouts/15/images/spcommon.png" /> </span> <br/>To save all changes use button <span style="cursor: pointer; width: 32px; height: 32px; overflow: hidden; display: inline-block; position: relative;-ms-transform:scale(0.7);-moz-transform:scale(0.7);-webkit-transform:scale(0.7);-o-transform:scale(0.7);"><img alt="" style="position: absolute; left: -308px; top: -478px;" src="/_layouts/15/images/SPS.MRibbon/formatmap32x32.png" /></span><br/>To cancel changes or close modal window use button <span style="cursor: pointer; width: 32px; height: 32px; overflow: hidden; display: inline-block; position: relative;-ms-transform:scale(0.7);-moz-transform:scale(0.7);-webkit-transform:scale(0.7);-o-transform:scale(0.7);"><img alt="" style="position: absolute; left: -205px; top: -69px;" src="/_layouts/15/images/SPS.MRibbon/formatmap32x32.png" /></span></p>
ru_ru: <p style="padding-right: 5px; font-size: 15px;margin:0px;"> Пожалуйста найдите SharePoint группу при помощи пикера. Когда вы найдете группу, можете добавить её используя кнопку <span style="width: 22px; height: 22px; overflow: hidden; display: inline-block; position: relative;"> <img alt="" style="position: absolute; left: -65px; top: -179px; cursor: pointer;" src="/_layouts/15/images/spcommon.png" /> </span> <br /> Для выбора группы используйте кнопку <span style="cursor: pointer; width: 20px; height: 20px; overflow: hidden; display: inline-block; position: relative; vertical-align: top;"> <img style="position: absolute; left: -178px; top: -31px;" src="/_layouts/15/images/spcommon.png" /> </span> <br /> Для удаления группы из списка используйте кнопку <span style="cursor: pointer; width: 20px; height: 20px; overflow: hidden; display: inline-block; position: relative; vertical-align: top;"> <img style="position: absolute; left: -178px; top: -75px;" src="/_layouts/15/images/spcommon.png" /> </span> <br/>Для сохранения изменений используйте кнопку <span style="cursor: pointer; width: 32px; height: 32px; overflow: hidden; display: inline-block; position: relative;-ms-transform:scale(0.7);-moz-transform:scale(0.7);-webkit-transform:scale(0.7);-o-transform:scale(0.7);"><img alt="" style="position: absolute; left: -308px; top: -478px;" src="/_layouts/15/images/SPS.MRibbon/formatmap32x32.png" /></span><br/>Для отмены изменений или закрытия окна настроек используйте кнопку <span style="cursor: pointer; width: 32px; height: 32px; overflow: hidden; display: inline-block; position: relative;-ms-transform:scale(0.7);-moz-transform:scale(0.7);-webkit-transform:scale(0.7);-o-transform:scale(0.7);"><img alt="" style="position: absolute; left: -205px; top: -69px;" src="/_layouts/15/images/SPS.MRibbon/formatmap32x32.png" /></span></p>

# SS_TH_NoGroups
source: There is no groups
ru_ru: Не найдено выбранных групп

# SS_TH_Actions
source: <div class="tabs"> <div class="tab"> <input type="radio" id="tab-1" name="tab-group-1" checked> <label for="tab-1">Page (Web Part)</label> <div class="content"> <span class="spn_perm"> <input type="checkbox" id="rib_p_edit" />Edit</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_mng" />Manage</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_share" />Share & Track</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_apprl" />Approvals</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_wkf" />Workflows</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_acts" />Page actions</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_tags" />Tags & Notes</span> </div> </div> <div class="tab"> <input type="radio" id="tab-2" name="tab-group-1"> <label for="tab-2">Wiki Page</label> <div class="content"> <span class="spn_perm"> <input type="checkbox" id="rib_wp_edit" />Edit</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_wp_mng" />Manage</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_wp_share" />Share & Track</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_wp_lsets" />Page library</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_wp_acts" />Page actions</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_wp_tags" />Tags & Notes</span> </div> </div> <div class="tab"> <input type="radio" id="tab-3" name="tab-group-1"> <label for="tab-3">Documents</label> <div class="content"> <table cellpadding="0" cellspacing="0" border="0"> <tr> <td style="padding-right: 5px;vertical-align: top;"> <span style="font-weight: 900;">&nbsp;Files</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_new" />New</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_open" />Open</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_mng" />Manage</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_share" />Share & Track</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_copies" />Copies</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_wkf" />Workflows</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_tags" />Tags & Notes</span> </td> <td style="vertical-align: top;"> <span style="font-weight: 900;">&nbsp;Library</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_view_frt" />View format</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_view_mng" />Manage views</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_tags" />Tags & Notes</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_share" />Share & Track</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_connect" />Connect & Export</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_cust_libs" />Customize library</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_sets" />Settings</span> </td> </tr> </table> </div> </div> <div class="tab"> <input type="radio" id="tab-4" name="tab-group-1"> <label for="tab-4">List</label> <div class="content"> <table cellpadding="0" cellspacing="0" border="0"> <tr> <td style="padding-right: 5px;vertical-align: top;"> <span style="font-weight: 900;">&nbsp;Items</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_new" />New</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_acts" />Actions</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_mng" />Manage</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_share" />Share & Track</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_tags" />Tags & Notes</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_wkf" />Workflows</span><br /> </td> <td style="vertical-align: top;"> <span style="font-weight: 900;">&nbsp;List</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_view_frt"" />View format</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_view_mng" />Manage views</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_tags" />Tags & Notes</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_share" />Share & Track</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_connect" />Connect & Export</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_cust_list" />Customize list</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_sets" />Settings</span> </td> </tr> </table> </div> </div> <div class="tab"> <input type="radio" id="tab-5" name="tab-group-1"> <label for="tab-5">Calendar</label> <div class="content"> <table cellpadding="0" cellspacing="0" border="0"> <tr> <td style="padding-right: 5px;vertical-align: top;"> <span style="font-weight: 900;">&nbsp;Events</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ce_new" />New</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ce_acts" />Actions</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ce_mng" />Manage</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ce_tags" />Tags & Notes</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ce_wkf" />Workflows</span><br /> </td> <td style="vertical-align: top;"> <span style="font-weight: 900;">&nbsp;Calendar</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_scope" />Scope</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_exp" />Expand</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_view_mng" />Manage views</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_tags" />Tags & Notes</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_share" />Share & Track</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_connect" />Connect & Export</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_cust_list" />Customize list</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_sets" />Settings</span> </td> </tr> </table> </div> </div> </div>
ru_ru: <div class="tabs"> <div class="tab"> <input type="radio" id="tab-1" name="tab-group-1" checked> <label for="tab-1">Страница</label> <div class="content"> <span class="spn_perm"> <input type="checkbox" id="rib_p_edit" />Редактирование</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_mng" />Управление</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_share" />Общее</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_apprl" />Утверждение</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_wkf" />Рабочие процессы</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_acts" />Действия страницы</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_p_tags" />Тэги и заметки</span> </div> </div> <div class="tab"> <input type="radio" id="tab-2" name="tab-group-1"> <label for="tab-2">Вики страница</label> <div class="content"> <span class="spn_perm"> <input type="checkbox" id="rib_wp_edit" />Редактирование</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_wp_mng" />Управление</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_wp_share" />Общее</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_wp_lsets" />Библиотека страниц</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_wp_acts" />Дейсвия страницы</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_wp_tags" />Тэги и заметки</span> </div> </div> <div class="tab"> <input type="radio" id="tab-3" name="tab-group-1"> <label for="tab-3">Документы</label> <div class="content"> <table cellpadding="0" cellspacing="0" border="0"> <tr> <td style="padding-right: 5px;vertical-align: top;"> <span style="font-weight: 900;">&nbsp;Файлы</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_new" />Создание</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_open" />Открытие</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_mng" />Управление</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_share" />Общее</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_copies" />Копии</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_wkf" />Рабочие процессы</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_df_tags" />Тэги и заметки</span> </td> <td style="vertical-align: top;"> <span style="font-weight: 900;">&nbsp;Библиотека</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_view_frt" />Формат представлений</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_view_mng" />Управление представлениями</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_tags" />Тэги и заметки</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_share" />Общее</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_connect" />Соединение и экспорт</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_cust_libs" />Пользовательская библиотека</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_dl_sets" />Настройки</span> </td> </tr> </table> </div> </div> <div class="tab"> <input type="radio" id="tab-4" name="tab-group-1"> <label for="tab-4">Список</label> <div class="content"> <table cellpadding="0" cellspacing="0" border="0"> <tr> <td style="padding-right: 5px;vertical-align: top;"> <span style="font-weight: 900;">&nbsp;Элементы</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_new" />Создание</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_acts" />Действия</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_mng" />Управление</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_share" />Общее</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_tags" />Тэги и заметки</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_li_wkf" />Рабочие процессы</span><br /> </td> <td style="vertical-align: top;"> <span style="font-weight: 900;">&nbsp;Список</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_view_frt"" />Формат представлений</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_view_mng" />Управление представлениями</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_tags" />Тэги и заметки</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_share" />Общее</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_connect" />Соединение и экспорт</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_cust_list" />Пользовательский список</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ll_sets" />Настройки</span> </td> </tr> </table> </div> </div> <div class="tab"> <input type="radio" id="tab-5" name="tab-group-1"> <label for="tab-5">Календарь</label> <div class="content"> <table cellpadding="0" cellspacing="0" border="0"> <tr> <td style="padding-right: 5px;vertical-align: top;"> <span style="font-weight: 900;">&nbsp;События</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ce_new" />Создание</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ce_acts" />Дейстаия</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ce_mng" />Управление</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ce_tags" />Тэги и заметки</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_ce_wkf" />Рабочие процессы</span><br /> </td> <td style="vertical-align: top;"> <span style="font-weight: 900;">&nbsp;Календарь</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_scope" />Области</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_exp" />Раскрытие</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_view_mng" />Управление представлениями</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_tags" />Тэги и заметки</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_share" />Общее</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_connect" />Соединение и экспорт</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_cust_list" />Пользовательский список</span><br /> <span class="spn_perm"> <input type="checkbox" id="rib_cc_sets" />Настройки</span> </td> </tr> </table> </div> </div> </div>
